nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/driver_examples/pdm/pdm_standalone_transfer_edma/cm7/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: N12, peripheral: PDM, signal: CLK, pin_signal: GPIO_AD_00, software_input_on: Enable}
  - {pin_num: R14, peripheral: PDM, signal: 'mic_bitstream, 0', pin_signal: GPIO_AD_01, software_input_on: Enable}
  - {pin_num: R13, peripheral: PDM, signal: 'mic_bitstream, 1', pin_signal: GPIO_AD_02, software_input_on: Enable}
  - {pin_num: R15, peripheral: PDM, signal: 'mic_bitstream, 2', pin_signal: GPIO_AD_03, software_input_on: Enable}
  - {pin_num: P15, peripheral: PDM, signal: 'mic_bitstream, 3', pin_signal: GPIO_AD_04, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_MIC_CLK,              /* GPIO_AD_00 is configured as MIC_CLK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_MIC_BITSTREAM00,      /* GPIO_AD_01 is configured as MIC_BITSTREAM00 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_01 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_MIC_BITSTREAM01,      /* GPIO_AD_02 is configured as MIC_BITSTREAM01 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_02 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_MIC_BITSTREAM02,      /* GPIO_AD_03 is configured as MIC_BITSTREAM02 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_03 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_04_MIC_BITSTREAM03,      /* GPIO_AD_04 is configured as MIC_BITSTREAM03 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_04 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
